# GetCurves Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCGeometryInfo..::..GetCurves Method
IFCGeometryInfo Class See Also
---
Gets the IfcCurve handles created representing the processed geometry and stored in this object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<IFCAnyHandle> GetCurves()
```

Visual Basic
---
```text
Public Function GetCurves As IList(Of IFCAnyHandle)
```

Visual C++
---
```text
public:
IList<IFCAnyHandle^>^ GetCurves()
```

# ### Return Value
The collection of curve handles.
# See Also
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace